In [1]:
import plotly.express as px
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [2]:
base_salario = pd.read_csv("data/salario.csv")

In [3]:
base_salario

   idade  salario
0     18      850
1     23     1500
2     28     2000
3     33     2200
4     38     2500
5     43     3500
6     48     3200
7     53     5000
8     58     6000
9     63     3000

# Divis√£o dos Dados

In [ ]:


X_salario = base_salario.iloc[:, 0].values
X_salario